Documents/ДополнительноеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДополнительноеСоглашение</Name>
			<BasedOn>
				<xr:Item>Document.Договор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДополнительноеСоглашение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СуммаДокумента > 0 И Документы.ДополнительноеСоглашение.ПолучитьСуммуПлатежа(Ссылка) < СуммаДокумента Тогда
		
		Текст = "Примите полную предоплату (" + СуммаДокумента + " руб.)";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, "СуммаДокумента");
		Отказ = Истина;
		
	КонецЕсли;
	
	ЛексСервер.СформироватьПоказателиСотрудников(Движения, Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Договор") Тогда
		Офис = ДанныеЗаполнения.Офис;
		Договор = ДанныеЗаполнения.Ссылка;
		//ВидИзменения = Перечисления.ВидИзмененийСтоимостиДоговора.Увеличить;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Отказ = НЕ ПроверитьЗаполнение();
	//РасторжениеДоговора = ВидИзменения = Перечисления.ВидИзмененийСтоимостиДоговора.Уменьшить 
	//И ЛексСервер.ПолучитьСтоимостьДоговора(Договор) * 0.9 < Сумма;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//МассивРолей = Новый Массив;
	//МассивРолей.Добавить("Администратор");
	//МассивРолей.Добавить("ГлавныйБухгалтер");
	//МассивРолей.Добавить("Бухгалтер");
	//
	//Если НЕ ЛексСервер.РольДоступнаВызовСервера(МассивРолей) Тогда
	//
	//	ДатаМонтажа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Договор, "ДатаУстановки");
	//	Если Дата > КонецДня(ДатаМонтажа) Тогда
	//		
	//		Отказ = Истина;
	//		
	//		ТекстСообщения = "Запрщено вводить дополнительное соглашение после даты монтажа"
	//		+ Символы.ПС + "Дата  монтажа: " + Формат(ДатаМонтажа, "ДЛФ=DD")
	//		+ Символы.ПС + "Дата соглашения: " + Формат(Дата, "ДЛФ=DD");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Дата");
	//		
	//	КонецЕсли;
	//
	//КонецЕсли;

КонецПроцедуры
